"""
Все решения для заданий нужно писать между строками BEGIN и END
Задание 1:
Реализуйте программу, которая вычисляет и выводит на экран значение выражения:
8 / 2 + 5 - -3 / 2
"""
#  BEGIN


#  END

"""
Задание 2:
Напишите программу, которая выведет на экран:
"Khal Drogo's favorite word is "athjahakar""
Программа должна вывести на экран эту фразу в точности. Обратите внимание на кавычки в начале и в конце фразы.
"""

#  BEGIN


#  END


"""
Задание 3:
Выведите на экран

Winter came for the House of Frey.

используя конкатенацию слов
"""

#  BEGIN


#  END


"""
Задание 4:
Присвойте переменной word значение "First text" и напечатайте ее
Поменяйте значние переменной word на "Second text" и напечатайте ее
"""

#  BEGIN


#  END


"""
Задание 5:
Напишите программу, которая спришивает у пользователя его имя и приветсвует его.

Пример общения:
>>> What's your name?
Maruf
>> Hello, Maruf!

Программа должная задавать вопрос What's your name?, считать имя и потом напечатать приветсвенное сообщение

"""

#  BEGIN


#  END
