"""
Задача 1.
Нужно будет реализовать калькулятор для простых математических выражений.
Выражение представляет из себя строчку вида "number1 operation number2", где
number1, number2 числа, а operation - это  что одно из "+", "-", "*", "/"
Примеры выражений: "1 + 2", "3 - 2", "4 * 2", "15 / 3"
Результатом решения будут два модуля: calc.py и main.py
calc.py реализуйте логику обработки математических выражений, а в main.py ввод/вывод данных и вызов методов
нужных методов из calc.py
"""

"""
Задача 2.
Нужно реализовать модуль string.py для работы строками и реализовать там несколько функций:
has_substring(s, t) - функция проверяет есть ли в строке s подстрока t. Мы такую задачу решали в предыдущих заданиях.
is_number(s) - проверяет что строка является числом. Например, строка "1234" является числом, а строка "abc12" не является.
is_case_insensitive_equal(s, t) - проверяет что строки одинаковы, даже если отличаются регистром букв. Например, "AAbbAA"
одинаковая со строкой "aaBBaA". Эти строки состоят из тех же букв на тех же позициях просто в разных регистрах. 
"""